{"data": [{"id": 0, "name": "¿Cuál es la forma correcta de acceder a una propiedad opcional de tipo String en Swift?", "answers": [{"id": "type_a", "value": "Usando if let optionalProperty = objeto.optionalProperty { // Haz algo con optionalProperty }"}, {"id": "type_b", "value": "Usando objeto?.optionalProperty ?? \"default value\""}, {"id": "type_c", "value": "Usando objeto.optionalProperty!"}, {"id": "type_d", "value": "Usando objeto?.optionalProperty"}], "code": "let optionalProperty: String?\n\nif let unwrappedProperty = optionalProperty {\n    print(unwrappedProperty)\n}\n\n// Output: nil\n", "gistURL": "https://gist.github.com/SwiftBeta/e1e0152457231dfbfc24d57370261929.js", "correct": "type_a", "created_by": "SwiftBeta_"}, {"id": 1, "name": "¿Qué es la propiedad lazy en Swift y cuál es su utilidad?", "answers": [{"id": "type_a", "value": "Es una propiedad que se ejecuta al instanciar un objeto y su utilidad es ahorrar memoria en tiempo de ejecución."}, {"id": "type_b", "value": "Es una propiedad que se ejecuta al llamarla por primera vez y su utilidad es evitar procesos de inicialización computacionalmente costosos."}, {"id": "type_c", "value": "Es una propiedad que se ejecuta cada vez que se instancie un objeto y su utilidad es evitar creación de objetos adicionales."}, {"id": "type_d", "value": "Es una propiedad que se ejecuta en un hilo en segundo plano y su utilidad es mejorar el rendimiento de la aplicación."}], "code": "class ExampleClass {\n    lazy var property: String = {\n        // Proceso computacionalmente costoso\n        return \"Property\"\n    }()\n}\n\nlet object = ExampleClass()\nprint(\"Lazy property not initialized yet\")\nprint(object.property)\n\n// Output:\n// Lazy property not initialized yet\n// Property\n", "gistURL": "https://gist.github.com/SwiftBeta/f1b3d1ddce2702b63c571330e040e874.js", "correct": "type_b", "created_by": "SwiftBeta_"}, {"id": 2, "name": "¿Cuál es el ciclo de vida de un View en SwiftUI?", "answers": [{"id": "type_a", "value": "Se crea el View, luego se llama a la función update y finalmente se destruye."}, {"id": "type_b", "value": "Se destruye el View, se actualiza y finalmente se crea de nuevo."}, {"id": "type_c", "value": "Se crea el View, se actualiza y finalmente se destruye."}, {"id": "type_d", "value": "Se destruye el View, se crea de nuevo y finalmente se llama a la función update."}], "code": "", "gistURL": "", "correct": "type_c", "created_by": "SwiftBeta_"}, {"id": 3, "name": "¿Qué es un Publisher en Combine y cuál es su utilidad?", "answers": [{"id": "type_a", "value": "Es un objeto que recibe uno o varios valores y los transforma en un único valor."}, {"id": "type_b", "value": "Es un objeto que recibe uno o varios valores y los transforma en un nuevo Publisher."}, {"id": "type_c", "value": "Es un objeto que envía uno o varios valores y se suscribe para realizar una tarea cuando reciba un valor."}, {"id": "type_d", "value": "Es un objeto que envía uno o varios valores y se suscribe para recibir un valor transformado de otro Publisher."}], "code": "", "gistURL": "", "correct": "type_d", "created_by": "SwiftBeta_"}, {"id": 4, "name": "¿Qué es un protocolo en Swift y cómo se utiliza?", "answers": [{"id": "type_a", "value": "Es un conjunto de funciones y propiedades que se heredan de una clase padre y se implementan en la subclase."}, {"id": "type_b", "value": "Es un conjunto de funciones y propiedades que se implementan en una clase y se heredan en las subclases."}, {"id": "type_c", "value": "Es un conjunto de funciones y propiedades que se implementan dentro de un objeto y se pueden llamar desde cualquier punto de la aplicación."}, {"id": "type_d", "value": "Es un conjunto de funciones y propiedades que se definen en un archivo separado y se importa en una clase para su uso."}], "code": "", "gistURL": "", "correct": "type_b", "created_by": "SwiftBeta_"}, {"id": 5, "name": "¿Qué es el Autolayout en UIKit y cómo se utiliza?", "answers": [{"id": "type_a", "value": "Es un sistema que permite diseñar interfaces de usuario adaptables a diferentes tamaños de pantalla."}, {"id": "type_b", "value": "Es una función de UIKit que permite crear animaciones de forma fácil y rápida."}, {"id": "type_c", "value": "Es una función de UIKit que permite redimensionar las vistas sin necesidad de crear nuevas instancias."}, {"id": "type_d", "value": "Es una función de UIKit que permite crear objetos con tamaños y características preestablecidas para su uso en la aplicación."}], "code": "", "gistURL": "", "correct": "type_a", "created_by": "SwiftBeta_"}, {"id": 6, "name": "¿Qué es una extensión en Swift y cómo se utiliza?", "answers": [{"id": "type_a", "value": "Es un nuevo tipo de objeto que se crea a partir de la combinación de dos o más objetos existentes."}, {"id": "type_b", "value": "Es un archivo separado del original que contiene una copia modificada de un objeto existente."}, {"id": "type_c", "value": "Es una forma de agregar métodos o propiedades a un tipo existente sin necesidad de crear una subclase."}, {"id": "type_d", "value": "Es una forma de crear nuevos objetos con características especiales para ser usados en la aplicación."}], "code": "", "gistURL": "", "correct": "type_c", "created_by": "SwiftBeta_"}, {"id": 7, "name": "¿Cómo se declara una propiedad estática en Swift?", "answers": [{"id": "type_a", "value": "static let property = value"}, {"id": "type_b", "value": "static var property: Type { get set }"}, {"id": "type_c", "value": "let static property = value"}, {"id": "type_d", "value": "var static property: Type { get set }"}], "code": "", "gistURL": "", "correct": "type_a", "created_by": "SwiftBeta_"}, {"id": 8, "name": "¿Cuál es la diferencia entre el operador ? y el operador ! en Swift?", "answers": [{"id": "type_a", "value": "El operador ? se utiliza para desempaquetar optionals, mientras que el operador ! se utiliza para definir una propiedad vacía."}, {"id": "type_b", "value": "El operador ? se utiliza para declarar una variable opcional, mientras que el operador ! se utiliza para declarar una variable no opcional."}, {"id": "type_c", "value": "El operador ? se utiliza para forzar el desempaquetamiento de una optional, mientras que el operador ! se utiliza para declarar una propiedad opcional."}, {"id": "type_d", "value": "El operador ? se utiliza para declarar una propiedad vacía, mientras que el operador ! se utiliza para desempaquetar optionals."}], "code": "", "gistURL": "", "correct": "type_c", "created_by": "SwiftBeta_"}, {"id": 9, "name": "¿Qué es un closure en Swift y cómo se utiliza?", "answers": [{"id": "type_a", "value": "Es una función que se ejecuta en un hilo en segundo plano y se suscribe para recibir un valor transformado de otro Publisher."}, {"id": "type_b", "value": "Es un bloque de código que se puede almacenar y pasar como un objeto a otra función o método."}, {"id": "type_c", "value": "Es una variable que almacena un valor opcional y se puede utilizar en una expresión de guard."}, {"id": "type_d", "value": "Es un objeto que encapsula un conjunto de valores y se puede utilizar para pasar datos entre diferentes partes de una aplicación."}], "code": "", "gistURL": "", "correct": "type_b", "created_by": "SwiftBeta_"}]}